
&НаКлиенте
Процедура Перепровести(Команда)
	
	ПерепровестиНаСервере();
	
	ПоказатьОповещениеПользователя("Перепроведение закончено",,"Период " + ПредставлениеПериода(Период.ДатаНачала,Период.ДатаОкончания,"ФП"));

КонецПроцедуры

&НаСервере
Процедура ПерепровестиНаСервере()
	
	//Отключаем расчет итогов при записи движений
	РегистрыБухгалтерии.Проводки.УстановитьИспользованиеИтогов(Ложь);
	
	Выборка = Документы.ПриобретениеТоваровИУслуг.Выбрать(Период.ДатаНачала, Период.ДатаОкончания);

	Пока Выборка.Следующий() = Истина Цикл
		
		Если Выборка.Проведен = Ложь Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ОбъектДокумент = Выборка.ПолучитьОбъект();
		ОбъектДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;

	//Включаем расчет итогов при записи движений
	//Расчитает итоги и по записанным движениям в режиме "без итогов"
	РегистрыБухгалтерии.Проводки.УстановитьИспользованиеИтогов(Истина);
	
	
КонецПроцедуры
