Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Если ПолучитьФункциональнуюОпцию("УчетПоПодразделениям"
	//	, Новый Структура("ПФО_Организация", Организация)) = Ложь Тогда
	//
	//	Индекс = ПроверяемыеРеквизиты.Найти("ПодразделениеОтправитель");
	//	ПроверяемыеРеквизиты.Удалить(Индекс);
	//	
	//	Индекс = ПроверяемыеРеквизиты.Найти("ПодразделениеПолучатель");
	//	ПроверяемыеРеквизиты.Удалить(Индекс);
	//
	//КонецЕсли;                      
	//
	//
	//Если ПолучитьФункциональнуюОпцию("УчетПоСкладам") = Ложь Тогда
	//	
	//	ПроверяемыеРеквизиты.Добавить("СкладОтправитель");
	//	ПроверяемыеРеквизиты.Добавить("СкладПолучатель");
	//	
	//КонецЕсли;                      
	
КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Проводки.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Движение = Движения.Проводки.Добавить();
		
		//--Общие для проводки -----
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТовары.Стоимость;
		Движение.СодержаниеПроводки = "Перемещение ТМЦ";
		Движение.Организация = Организация;
			
		//--Дебет -----
		Движение.СчетДт = ТекСтрокаТовары.НовыйСчетУчета;
		БухгалтерияНаСервере.ЗаполнитьПодразделениеСтороныПроводки(Движение,ПодразделениеПолучатель,"Дт");
		
		БухгалтерияНаСервере.ЗаполнитьСубконтоСтороныПроводки(Движение,"Номенклатура", ТекСтрокаТовары.Номенклатура, "Дт");
		БухгалтерияНаСервере.ЗаполнитьСубконтоСтороныПроводки(Движение,"Склады", СкладПолучатель, "Дт");
		
		//--Кредит ----
		Движение.СчетКт = ТекСтрокаТовары.СчетУчета;
		БухгалтерияНаСервере.ЗаполнитьПодразделениеСтороныПроводки(Движение,ПодразделениеОтправитель,"Кт");
		
		БухгалтерияНаСервере.ЗаполнитьСубконтоСтороныПроводки(Движение,"Номенклатура", ТекСтрокаТовары.Номенклатура, "Кт");
		БухгалтерияНаСервере.ЗаполнитьСубконтоСтороныПроводки(Движение,"Склады", СкладОтправитель, "Кт");
		
		
	КонецЦикла;

КонецПроцедуры

