
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Проводки.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Если ВидОперации = Перечисления.ВидыОперацийПродажиТоваров.ВозвратСХранения Тогда
			
			Движение = Движения.Проводки.Добавить();
			
			//--Общие для проводки -----
			Движение.Период = Дата;
			Движение.Сумма = ТекСтрокаТовары.Стоимость;
			Движение.СодержаниеПроводки = "Возвращены товары владельцу";
			Движение.Организация = Организация;
			
			//--Дебет -----
			
			//Нет счета Дебет!!!
			
			//--Кредит ----
			Движение.СчетКт = ТекСтрокаТовары.СчетУчета;
			БухгалтерияНаСервере.ЗаполнитьПодразделениеСтороныПроводки(Движение,Подразделение,"Кт");
			БухгалтерияНаСервере.ЗаполнитьСубконтоСтороныПроводки(Движение,"Номенклатура", ТекСтрокаТовары.Номенклатура, "Кт");
			БухгалтерияНаСервере.ЗаполнитьСубконтоСтороныПроводки(Движение,"Склады", Склад, "Кт");
			БухгалтерияНаСервере.ЗаполнитьСубконтоСтороныПроводки(Движение,"Контрагенты", Контрагент, "Кт");
			
		Иначе 	
			
			Движение = Движения.Проводки.Добавить();
			//--Общие для проводки -----
			Движение.Период = Дата;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
			Движение.СодержаниеПроводки = "Выручка от продажи";
			Движение.Организация = Организация;
			
			//--Дебет -----
			Движение.СчетДт = ПланыСчетов.Счета.ПокупателямОтгрузили;
			БухгалтерияНаСервере.ЗаполнитьПодразделениеСтороныПроводки(Движение,Подразделение,"Дт");
			БухгалтерияНаСервере.ЗаполнитьСубконтоСтороныПроводки(Движение,"Договоры", Договор, "Дт");
			БухгалтерияНаСервере.ЗаполнитьСубконтоСтороныПроводки(Движение,"Контрагенты", Контрагент, "Дт");
			
			//--Кредит ----
			Движение.СчетКт = ПланыСчетов.Счета.РасходыДоходы;
			БухгалтерияНаСервере.ЗаполнитьПодразделениеСтороныПроводки(Движение,Подразделение,"Кт");
			
			Движение = Движения.Проводки.Добавить();
			
			
			
			//--Общие для проводки -----
			Движение.Период = Дата;
			Движение.Сумма = ТекСтрокаТовары.Стоимость;
			Движение.СодержаниеПроводки = "Себестоимость продажи";
			Движение.Организация = Организация;
			
			//--Дебет -----
			Движение.СчетДт = ПланыСчетов.Счета.РасходыДоходы;
			БухгалтерияНаСервере.ЗаполнитьПодразделениеСтороныПроводки(Движение,Подразделение,"Дт");
			
			//--Кредит ----
			Движение.СчетКт = ТекСтрокаТовары.СчетУчета;
			БухгалтерияНаСервере.ЗаполнитьПодразделениеСтороныПроводки(Движение,Подразделение,"Кт");
			
			БухгалтерияНаСервере.ЗаполнитьСубконтоСтороныПроводки(Движение,"Номенклатура", ТекСтрокаТовары.Номенклатура, "Кт");
			БухгалтерияНаСервере.ЗаполнитьСубконтоСтороныПроводки(Движение,"Склады", Склад, "Кт");
			БухгалтерияНаСервере.ЗаполнитьСубконтоСтороныПроводки(Движение,"Контрагенты", Контрагент, "Кт");
			
		КонецЕсли; 
		
	КонецЦикла;

КонецПроцедуры




