

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Проводки.Записывать = Истина;
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Движение = Движения.Проводки.Добавить();

		//Движение.Организация = Организация;
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТовары.Стоимость;
		Движение.СодержаниеПроводки = "Перемещение ТМЦ";
		
		Движение.СчетДт = ТекСтрокаТовары.НовыйСчетУчета;
		Движение.СчетКт = ТекСтрокаТовары.СчетУчета;
		
		
	КонецЦикла;

КонецПроцедуры

