Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Проводки.Записывать = Истина;

	Движение = Движения.Проводки.Добавить();

	Движение.СчетДт = МестоХраненияДенежныхСредств.СчетУчета;
	БухгалтерияНаСервере.ЗаполнитьПодразделениеСтороныПроводки(Движение, Подразделение, "Дт");

	Движение.СчетКт = КорСчет;
	БухгалтерияНаСервере.ЗаполнитьПодразделениеСтороныПроводки(Движение, Подразделение, "Кт");

	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Сумма = Сумма;
	Движение.СодержаниеПроводки = "Поступили денежные средства";

КонецПроцедуры