Процедура ПередЗаписью(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	УчетДДС.Значение КАК Значение
				   |ИЗ
				   |	Константа.УчетДДС КАК УчетДДС";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ДополнительныеСвойства.Вставить("ЗначениеДо", ВыборкаДетальныеЗаписи.Значение);

	КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	УчетДДС.Значение КАК Значение
				   |ИЗ
				   |	Константа.УчетДДС КАК УчетДДС";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();

	ДополнительныеСвойства.Вставить("ЗначениеПосле", ВыборкаДетальныеЗаписи.Значение);

	Если ДополнительныеСвойства.ЗначениеПосле <> ДополнительныеСвойства.ЗначениеДо Тогда

		Если ДополнительныеСвойства.ЗначениеПосле = Истина Тогда

			СписокСчетовУчетаДС = Новый СписокЗначений;
			СписокСчетовУчетаДС.Добавить(ПланыСчетов.Счета.Касса);
			СписокСчетовУчетаДС.Добавить(ПланыСчетов.Счета.СчетВБанке);
			СписокСчетовУчетаДС.Добавить(ПланыСчетов.Счета.ВалютныйСчетВБанке);

			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
						   |	Счета.Ссылка КАК Ссылка
						   |ИЗ
						   |	ПланСчетов.Счета КАК Счета
						   |ГДЕ
						   |	Счета.Ссылка В (&СписокСчетовУчетаДС)";

			Запрос.УстановитьПараметр("СписокСчетовУчетаДС", СписокСчетовУчетаДС);

		Иначе

			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
						   |	СчетаВидыСубконто.Ссылка
						   |ИЗ
						   |	ПланСчетов.Счета.ВидыСубконто КАК СчетаВидыСубконто
						   |ГДЕ
						   |	СчетаВидыСубконто.ВидСубконто = &ВидСубконто";

			Запрос.УстановитьПараметр("ВидСубконто", ПланыВидовХарактеристик.ВидыСубконто.ДвиженияДенежныхСредств);

		КонецЕсли;

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			ДанныеСчета = НаСервереМожноВызватьСКлиента.ПолучитьСвойствоСчета(ВыборкаДетальныеЗаписи.Ссылка);

			ПСОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();

			Если ДополнительныеСвойства.ЗначениеПосле = Истина Тогда

				Если ДанныеСчета.КоличествоСубконто = 2 Тогда
					Продолжить;
				КонецЕсли;

				НоваяСтрока = ПСОбъект.ВидыСубконто.Добавить();
				НоваяСтрока.ВидСубконто = ПланыВидовХарактеристик.ВидыСубконто.ДвиженияДенежныхСредств;

			Иначе

				СтрокаДляУдаления = ПСОбъект.ВидыСубконто.Найти(
					ПланыВидовХарактеристик.ВидыСубконто.ДвиженияДенежныхСредств, "ВидСубконто");

				ПСОбъект.ВидыСубконто.Удалить(СтрокаДляУдаления);

			КонецЕсли;

			ПСОбъект.Записать();

		КонецЦикла;

	КонецЕсли;
КонецПроцедуры