Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Проводки.Записывать = Истина;
	

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Движение = Движения.Проводки.Добавить();
		
		//--Общие для проводки -----
		
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.СодержаниеПроводки = "Поступили ТМЦ";
		Движение.Организация = Организация;
		
		//--Дебет -----
		Движение.СчетДт = ТекСтрокаТовары.СчетУчета;

		БухгалтерияНаСервере.ЗаполнитьПодразделениеСтороныПроводки(Движение,Подразделение,"Дт");
		
		БухгалтерияНаСервере.ЗаполнитьСубконтоСтороныПроводки(Движение,"Номенклатура", ТекСтрокаТовары.Номенклатура, "Дт");
		БухгалтерияНаСервере.ЗаполнитьСубконтоСтороныПроводки(Движение,"Склады", Склад, "Дт");
		БухгалтерияНаСервере.ЗаполнитьСубконтоСтороныПроводки(Движение,"Контрагенты", Контрагент, "Дт");
		
		БухгалтерияНаСервере.ЗаполнитьКоличествоСтороныПроводки(Движение, ТекСтрокаТовары.Количество, "Дт");
		//--Кредит ----
		Если Не ТекСтрокаТовары.СчетУчета.Забалансовый Тогда
		
			Если Валюта = Справочники.Валюты.РубльРФ Тогда
				Движение.СчетКт = ПланыСчетов.Счета.РасчетыСПоставщикамиРубли;
			Иначе
				Движение.СчетКт = ПланыСчетов.Счета.РасчетыСПоставщикамиВалюта;				
			КонецЕсли;
			
			БухгалтерияНаСервере.ЗаполнитьПодразделениеСтороныПроводки(Движение,Подразделение,"Кт");
			
			БухгалтерияНаСервере.ЗаполнитьСубконтоСтороныПроводки(Движение,"Контрагенты", Контрагент, "Кт");
			БухгалтерияНаСервере.ЗаполнитьСубконтоСтороныПроводки(Движение,"Договоры", Договор, "Кт");
			
			БухгалтерияНаСервере.ЗаполнитьКоличествоСтороныПроводки(Движение, ТекСтрокаТовары.Количество, "Кт");

		КонецЕсли; 
		
		
	КонецЦикла;

КонецПроцедуры




