//---ПФО "Учет по подразделениям"

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	ПараметрыФО = Новый Структура;
	ПараметрыФО.Вставить("ПФО_Организация", Объект.Организация);
	
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	
КонецПроцедуры // УстановитьВидимостьЭлементовФормы()


&НаСервере
Процедура МестоХраненияДенежныхСредствПриИзмененииНаСервере()
	
	ПараметрыФО = Новый Структура("ПФО_Организация", Объект.Организация);
	ВалютныйУчетПоОрганизации = ПолучитьФункциональнуюОпцию("ВалютныйУчет", ПараметрыФО);

	Если (ВалютныйУчетПоОрганизации = Истина) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	МестаХраненияДенежныхСредств.СчетУчета
			|ИЗ
			|	Справочник.МестаХраненияДенежныхСредств КАК МестаХраненияДенежныхСредств
			|ГДЕ
			|	МестаХраненияДенежныхСредств.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.МестоХраненияДенежныхСредств);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий(); 

		ДанныеСчета = НаСервереМожноВызватьСКлиента.ПолучитьСвойствоСчета(ВыборкаДетальныеЗаписи.СчетУчета);

		Если (ДанныеСчета.Валютный = Истина) Тогда
			Элементы.Валюта.Видимость = Истина
		Иначе
			Элементы.Валюта.Видимость = Ложь
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияДенежныхСредствПриИзменении(Элемент)

	МестоХраненияДенежныхСредствПриИзмененииНаСервере();

КонецПроцедуры



//--
&НаСервере
Процедура КорСчетПриИзмененииНаСервере()


	
КонецПроцедуры

&НаКлиенте
Процедура КорСчетПриИзменении(Элемент)
	
	КорСчетПриИзмененииНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура КорСубконто1ПриИзменении(Элемент)
	КорСубконто1ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КорСубконто1ПриИзмененииНаСервере()



	
КонецПроцедуры


