
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОрганизацияПриИзмененииНаСервере();
	КорСчетПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()

	УстановитьПараметрыФункциональныхОпцийФормы(
	Новый Структура("ПФО_Организация", Объект.Организация));
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	КорСчетПриИзмененииНаСервере();
	
КонецПроцедуры


&НаСервере
Процедура КорСчетПриИзмененииНаСервере()


	
КонецПроцедуры

&НаКлиенте
Процедура КорСчетПриИзменении(Элемент)
	
	КорСчетПриИзмененииНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура КорСубконто1ПриИзменении(Элемент)
	КорСубконто1ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КорСубконто1ПриИзмененииНаСервере()



	
КонецПроцедуры
