//---ПФО "Учет по подразделениям"

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	ПараметрыФО = Новый Структура;
	ПараметрыФО.Вставить("ПФО_Организация", Объект.Организация);
	
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	
КонецПроцедуры // УстановитьВидимостьЭлементовФормы()


//--
&НаСервере
Процедура КорСчетПриИзмененииНаСервере()


	
КонецПроцедуры

&НаКлиенте
Процедура КорСчетПриИзменении(Элемент)
	
	КорСчетПриИзмененииНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура КорСубконто1ПриИзменении(Элемент)
	КорСубконто1ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КорСубконто1ПриИзмененииНаСервере()



	
КонецПроцедуры
