&НаКлиенте
Процедура Исправить(Команда)
	ИсправитьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИсправитьНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Счета.Ссылка,
	|	Счета.Количественный
	|ИЗ
	|	ПланСчетов.Счета КАК Счета";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		ПС_Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();

		Для Каждого ТекСубконто Из ПС_Объект.ВидыСубконто Цикл

			ТекСубконто._Суммовой = Истина;
			Если ВыборкаДетальныеЗаписи.Количественный = Истина Тогда

				ТекСубконто._Количественный = Истина;

			КонецЕсли;
		КонецЦикла;

		ПС_Объект.Записать();

	КонецЦикла;

КонецПроцедуры