Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Проводки.Записывать = Истина;

	Для Каждого ТекСтрокаТовары Из Товары Цикл

		Движение = Движения.Проводки.Добавить();
		
		Если Движение.СчетДт.ПоПодразделениям = Истина Тогда

			Движение.СчетДт = ТекСтрокаТовары.НовыйСчетУчета;

		КонецЕсли;

		Если Движение.СчетКт.ПоПодразделениям = Истина Тогда

			Движение.СчетКт = ТекСтрокаТовары.СчетУчета;

		КонецЕсли;
		
		Движение.Период = Дата;
		Движение.Сумма = ТекСтрокаТовары.Стоимость;
		Движение.СодержаниеПроводки = "Перемещение ТМЦ";
		Движение.Организация = Организация;

	КонецЦикла;

КонецПроцедуры